#### Terraform Staging Format and Style 🖌 `success`
#### Terraform Staging Initialization ⚙️ `success`
#### Terraform Staging Validation 🤖 `success`
<details><summary>Staging Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Staging Plan 📖 `success`

<details><summary>Show Staging Plan</summary>

```

terraform
data.databricks_current_user.service_principal: Reading...
data.databricks_current_user.service_principal: Read complete after 2s [id=5298993127391214]
databricks_job.batch_inference_job: Refreshing state... [id=464289046985023]
databricks_permissions.batch_job_permissions: Refreshing state... [id=/jobs/464289046985023]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # databricks_job.model_training_job will be created
  + resource "databricks_job" "model_training_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "staging-nuwan-mlops-stacks-test-model-training-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "main"
          + provider = "gitHub"
          + url      = "https://github.com/nuwan-db/nuwan-mlops-stacks-test"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 9 * * ?"
          + timezone_id            = "UTC"
        }

      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "Train"

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env" = "staging"
                }
              + notebook_path   = "nuwan-mlops-stacks-test/training/notebooks/Train"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "ModelValidation"

          + depends_on {
              + task_key = "Train"
            }

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "custom_metrics_loader_function"        = "custom_metrics"
                  + "enable_baseline_comparison"            = "true"
                  + "env"                                   = "staging"
                  + "evaluator_config_loader_function"      = "evaluator_config"
                  + "experiment_name"                       = "/nuwan-mlops-stacks-test/staging-nuwan-mlops-stacks-test-experiment"
                  + "run_mode"                              = "disabled"
                  + "validation_input"                      = "SELECT * FROM delta.`dbfs:/databricks-datasets/nyctaxi-with-zipcodes/subsampled`"
                  + "validation_thresholds_loader_function" = "validation_thresholds"
                }
              + notebook_path   = "nuwan-mlops-stacks-test/validation/notebooks/ModelValidation"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "TriggerModelDeploy"

          + depends_on {
              + task_key = "ModelValidation"
            }

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + data_security_mode           = "SINGLE_USER"
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + single_user_name             = "47bcaa5e-d998-4756-b490-5225159c60f6"
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env" = "staging"
                }
              + notebook_path   = "nuwan-mlops-stacks-test/deployment/model_deployment/notebooks/TriggerModelDeploy"
            }
        }
    }

  # databricks_mlflow_experiment.experiment will be created
  + resource "databricks_mlflow_experiment" "experiment" {
      + creation_time    = (known after apply)
      + description      = "MLflow Experiment used to track runs for nuwan-mlops-stacks-test project."
      + experiment_id    = (known after apply)
      + id               = (known after apply)
      + last_update_time = (known after apply)
      + lifecycle_stage  = (known after apply)
      + name             = "/nuwan-mlops-stacks-test/staging-nuwan-mlops-stacks-test-experiment"
    }

  # databricks_mlflow_model.registered_model will be created
  + resource "databricks_mlflow_model" "registered_model" {
      + creation_timestamp     = (known after apply)
      + description            = (known after apply)
      + id                     = (known after apply)
      + last_updated_timestamp = (known after apply)
      + name                   = "staging-nuwan-mlops-stacks-test-model"
      + registered_model_id    = (known after apply)
      + user_id                = (known after apply)
    }

  # databricks_permissions.mlflow_experiment_permissions will be created
  + resource "databricks_permissions" "mlflow_experiment_permissions" {
      + experiment_id = (known after apply)
      + id            = (known after apply)
      + object_type   = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.mlflow_model_permissions will be created
  + resource "databricks_permissions" "mlflow_model_permissions" {
      + id                  = (known after apply)
      + object_type         = (known after apply)
      + registered_model_id = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.training_job_permissions will be created
  + resource "databricks_permissions" "training_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + nuwan-mlops-stacks-test_experiment_id          = (known after apply)
  ~ nuwan-mlops-stacks-test_experiment_name        = "/nuwan-mlops-stacks-test-staging/staging-nuwan-mlops-stacks-test-experiment" -> "/nuwan-mlops-stacks-test/staging-nuwan-mlops-stacks-test-experiment"
  + nuwan-mlops-stacks-test_training_job_id        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>